/* -*- Mode: C; c-file-style: "linux"; -*- */
#ifndef COMMONDS_H_
#define COMMONDS_H_

#include <sys/types.h>

#pragma pack(1)

/* Maximum number of QoS flows MIH can handle per transation. */
#define MIH_MAX_FLOWS 16

// Parameter Types
typedef enum {
        MIH_TYPE_MMPL = 2, // list of supportet mobility protocols
        MIH_TYPE_QOS_INFO = 27, // QoS flows information
        MIH_TYPE_MULTICAST_INFO = 30,  // Multicast Info. QoS flow Id
        MIH_TYPE_LINK_CHANNEL = 220, // the channel where the RAL should connect
        MIH_TYPE_LINK_ESSID = 221, // the essid where the link should connect
        MIH_TYPE_STATUS = 245,
        MIH_TYPE_IP_ADDRESS = 247, // the Layer 3 address of a AR
        MIH_TYPE_MAC_POA = 250, // the Layer 2 address or ID of a PoA
        MIH_TYPE_LINK_ID = 243, // the ID of the link VMAC
        MIH_TYPE_EVENTS_MAP = 255, // a list of supported events where 1 means supported an 0 unsupported
        MIH_TYPE_REASON_CODE = 3,
        MIH_TYPE_LINK_TYPE = 248,
        MIH_TYPE_UNIX_SOCKET = 133, // the name of the UnixSocket use for communication vina LINK_SAP
        MIH_TYPE_LQPT = 8, // Link Quality Parameter Type
        MIH_TYPE_LQPOV = 9, // Link Quality Parameter Old Value
        MIH_TYPE_LQPNV = 10, // Link Quality Parameter New Value
        MIH_TYPE_LQPV = 22, // Link Quality Parameter Value
        MIH_TYPE_LINK_PARAMETER_THRESHOLD = 16,
        MIH_TYPE_FLOW_ID_LIST = 28, // List of Flow IDs (for QoS)
        MIH_TYPE_LINK_ACTION = 13,
        MIH_TYPE_INTERFACE_ID = 251,
        MIH_TYPE_VID =180,
        MIH_TYPE_INTERFACE_NAME = 200,
        MIH_TYPE_LINK_LOCAL_ADDRESS = 190,
} MIH_DataTypeCode;

// Primitive types
typedef enum {
		MIH_TYPE_MIH_EVENT_REGISTER = 1,
        MIH_TYPE_LINK_CONFIGURE_THRESHOLDS = 3,
        MIH_TYPE_LINK_SWITCH = 20,
        MIH_TYPE_LINK_GET_PARAMETERS = 21,
//        MIH_TYPE_LINK_RESOURCE_DEACTIVATE = 26,
//        MIH_TYPE_LINK_RESOURCE_ACTIVATE = 40,
        MIH_TYPE_LINK_MULTICAST_JOIN = 25,
        MIH_TYPE_LINK_MULTICAST_LEAVE = 24,
        MIH_TYPE_LINK_ADVERTISMENT = 22,

        MIH_TYPE_LINK_UP = 4,
        MIH_TYPE_LINK_DOWN = 5,
        MIH_TYPE_LINK_PARAMETERS_REPORT = 9,

		MIH_TYPE_MIH_SWITCH = 20,
		MIH_TYPE_MIH_MULTICAST_JOIN = 25,
		MIH_TYPE_MIH_MULTICAST_LEAVE = 24,
		MIH_TYPE_MIH_USER_REGISTRATION = 30,
		MIH_TYPE_MIH_HANDOVER_PREPARE = 32,
		MIH_TYPE_MIH_HANDOVER_INITIATE = 13,
		MIH_TYPE_MIH_HANDOVER_COMMIT = 14,
		MIH_TYPE_MIH_HANDOVER_COMPLETE = 12,
		MIH_TYPE_MIH_SCAN = 31,
		MIH_TYPE_MIH_LINK_RESOURCE_ACTIVATE = 33,
		MIH_TYPE_MIH_LINK_RESOURCE_DEACTIVATE = 34,
} MIH_PrimitiveTypeCode;

//Events codes; to build an event map (32 bits long) just add the required values from the ones below.
typedef enum {
	MIH_EVENT_Link_AdvertisementIndication = 1, 		//00000001 0 0 0
	MIH_EVENT_Link_UpIndication = 128, 					//10000000 0 0 0
	MIH_EVENT_Link_DownIndication = 64, 				//01000000 0 0 0
	MIH_EVENT_Link_Parameters_ReportIndication = 32,	//00100000 0 0 0
	MIH_EVENT_MIH_User_RegistrationIndication = 32768, 	//0 10000000 0 0	
	MIH_EVENT_MIH_Handover_InitiateIndication = 16384, 	//0 01000000 0 0
	MIH_EVENT_MIH_Handover_CommitIndication = 8192, 	//0 00100000 0 0
	MIH_EVENT_MIH_Handover_CompleteIndication = 4096, 	//0 00010000 0 0
} MIH_Events;

typedef enum {
	MIH_LINK_TYPE_GENERIC = 0,
	MIH_LINK_TYPE_ETHERNET = 15,
	MIH_LINK_TYPE_WLAN = 19,
	MIH_LINK_TYPE_ADHOC = 20,
	MIH_LINK_TYPE_UMTS = 23,
	MIH_LINK_TYPE_DVB = 30,
	MIH_LINK_TYPE_WiMAX = 31,
} MIH_LinkTypes;

//Basic types in TLV form

typedef struct {
        u_int8_t type;		//3
        u_int16_t length; 	//1
        u_int8_t reserved;
        u_int8_t value;
        u_int8_t reserved2[3];
}MIH_ReasonCode;

typedef struct {
        u_int8_t type;		//248
        u_int16_t length; 	//4
        u_int8_t reserved;
        u_int32_t value;
}MIH_LinkType;
 
typedef struct {
        u_int8_t type;		//245
        u_int16_t length; 	//1
        u_int8_t reserved;
        u_int8_t value;		//0-Success; 1-Failure; 2-Rejected
        u_int8_t reserved2[3];
}MIH_Status;

typedef struct {
        u_int8_t type;		//251
        u_int16_t length;	//8
        u_int8_t reserved;
        u_int8_t value[8];
}MIH_InterfaceID;

typedef struct {
        u_int8_t type;		//250
        u_int16_t length;	//8
        u_int8_t reserved;
        u_int8_t value[8];
}MIH_MACPoA;

typedef struct {
        u_int8_t type;		//243
        u_int16_t length;	//24
        u_int8_t reserved; 
		MIH_InterfaceID interfaceL2ID;
        MIH_MACPoA poaL2ID;
}MIH_LinkID; //28 bytes

typedef struct {
        u_int8_t type;		//133
        u_int16_t length;	//28
        u_int8_t reserved;
        u_int8_t value[28];
}MIH_UnixSocket;

typedef struct {
        u_int8_t type;		//255
        u_int16_t length;	//4
        u_int8_t reserved;
        u_int32_t value;
}MIH_EventsMap;

typedef struct {
        u_int8_t type;		//247
        u_int16_t length;	//16
        u_int8_t reserved;
        u_int8_t value[16];
}MIH_IPAddress;

typedef struct {
        u_int8_t type;		//190
        u_int16_t length;	//48
        u_int8_t reserved;
        u_int8_t value[48];
}MIH_LinkLocalAddress;



typedef struct {	//Mobility Management Protocol List
        u_int8_t type;		//2
        u_int16_t length;	//1
        u_int8_t reserved;
        u_int8_t value;		// see 802.21 doc
        u_int8_t reserved2[3];
}MIH_MMPL;

typedef struct {	//Link Quality Parameter Type
        u_int8_t type;		//8
        u_int16_t length;	//4
        u_int8_t reserved;
        u_int32_t value;		
}MIH_LQPT;

typedef struct {	//Link Quality Parameter Old Value
        u_int8_t type;		//9
        u_int16_t length;	//4
        u_int8_t reserved;
        u_int32_t value;		
}MIH_LQPOV;

typedef struct {	//Link Quality Parameter New Value
        u_int8_t type;		//10
        u_int16_t length;	//4
        u_int8_t reserved;
        u_int32_t value;		
}MIH_LQPNV;

typedef struct {	//Link Quality Parameter Value
        u_int8_t type;		//22

        u_int16_t length;	//4
        u_int8_t reserved;
        u_int32_t value;		
}MIH_LQPV;

typedef struct {	//Block unit for a report
        MIH_LQPT parameterType;
        MIH_LQPOV oldValue;
        MIH_LQPNV newValue;
}MIH_ReportInfo;

typedef struct {	
        u_int8_t type;		//16
        u_int16_t length;	//4
        u_int8_t reserved;
        u_int32_t value;		
}MIH_LinkParameterThreshold;

typedef struct {
        u_int8_t type;		//220
        u_int16_t length;	//4
        u_int8_t reserved;
        u_int32_t value;		
}MIH_LinkChannel;

typedef struct {
        u_int8_t type;		//221
        u_int16_t length;	//28
        u_int8_t reserved;
        u_int8_t value[28];		
}MIH_LinkESSID;

typedef struct {	//Block unit for ConfigureThresholdsRequest
        MIH_LQPT parameterType;
        MIH_LinkParameterThreshold initiateTh;
        MIH_LinkParameterThreshold rollbackTh;
        MIH_LinkParameterThreshold executeTh;
}MIH_ConfigureThresholdInfoRequestBlock;

typedef struct {	//Block unit for ConfigureThresholdsConfirm
        MIH_LQPT parameterType;
        MIH_Status status;
}MIH_ConfigureThresholdInfoConfirmBlock;

typedef struct {	//BlockUnit for MIH_ScanResponse and Link_Get_ParametersConfirm
	MIH_MACPoA PoA;
	MIH_LQPT lqpt;
	MIH_LQPV lqpv;
	MIH_LinkType linkType;
	MIH_LinkChannel channel;
	MIH_LinkESSID essid;
}MIH_ScanResponseInfoBlock;

typedef struct {
        u_int8_t type;		//13
        u_int16_t length;	//4
        u_int8_t reserved;
        u_int32_t value;		
}MIH_LinkAction;

typedef enum {
        MIH_UPLINK,
        MIH_DOWNLINK,
}MIH_FlowDirection;

typedef struct {
        u_int8_t classIdentifier;
        float reservedBitrate;
}MIH_RSpec;

typedef struct {
        float meanBitrate;
        float bucketDepth;
        float peakBitrate;
        float maximumTransmissionUnit;
}MIH_TSpec;

typedef struct {
        u_int16_t flowIdentifier;
        MIH_FlowDirection direction:8;
        MIH_RSpec rspec;
        MIH_TSpec tspec;
}MIH_FlowSpec;

typedef struct {
        u_int8_t type;		//27
        u_int16_t length;	//384
        u_int8_t reserved;
        MIH_FlowSpec value[MIH_MAX_FLOWS]; /* value[length/sizeof(MIH_FlowSpec)] */
}MIH_QoSInfo; //388

typedef struct {
        u_int8_t type;		//28
        u_int16_t length;	//64
        u_int8_t reserved;
        u_int32_t flowIDs[MIH_MAX_FLOWS];
}MIH_FlowIDList; //68

/* typedef struct { */
/*         u_int8_t type;		//30 */
/*         u_int16_t length;	//4 */
/*         u_int8_t reserved; */
/*         u_int32_t value; */
/* }MIH_MulticastInfo; //8 */

typedef struct {
        u_int8_t type;		//180
        u_int16_t length;	//8
        u_int8_t reserved;
        u_int8_t value[8];
}MIH_VID;	//12

typedef struct {
        u_int8_t type;		//100
        u_int16_t length;	//20
        u_int8_t reserved;
        u_int8_t value[20];				
}MIHF_ID;

typedef struct {
        u_int8_t type;		//101
        u_int16_t length;	//20
        u_int8_t reserved;
        u_int8_t value[20];				
}MIH_USER_ID;

typedef union {
        MIH_LinkLocalAddress remoteAddress;
        MIH_UnixSocket localAddress;
}MIH_User_Address;

typedef struct {
    u_int8_t type;		//200
    u_int16_t length;	//8
    u_int8_t reserved;
    u_int8_t value[8];				
}MIH_InterfaceName;

//Link Primitives

/*
 0                   1                   2                   3
 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
|Vers.  |Q|P|     Reserved      |servID | op|  event/comm. ID   |
+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
|        Transaction ID         |      VariableLoadLength       |
+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
|   Type-LT     |          Length-LT            |  Reserved-LT  |
+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
|                           Value-LT                            |
+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ - LinkID Block
|   Type-LID    |          Length-LID           |  Reserved-LID |
